src/Documents/РасчетнаяВедомость/РасчетнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетнаяВедомость</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СтавкиСотрудников/СтавкиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ПроизводственныйКалендарь</schedule>
  <scheduleValue>InformationRegister.ПроизводственныйКалендарь.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ПроизводственныйКалендарь.Dimension.День</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВидыРасчетов</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/Documents/РасчетнаяВедомость/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;

	Для Каждого СтрокаСотрудника из СписокСотрудников Цикл
		СтрокаСотрудника.Ставка = РегистрыСведений.СтавкиСотрудников.ПолучитьСтавку(СтрокаСотрудника.Сотрудник, Дата);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчетов.Ставка;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Ставка = ТекСтрокаСписокСотрудников.Ставка;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
    Движения.Зарплата.Рассчитать();

КонецПроцедуры



#КонецОбласти
